load-test.yaml
config:
  target: 'http://localhost:3000'
  http:
    timeout: 30
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 5
      name: Warm up the API
    - duration: 20
      arrivalRate: 5
      name: Sustained load
  variables:
    url: '/process-data-sync'
  environments:
    sync:
      variables:
        url: '/process-data-sync'
    async:
      variables:
        url: '/process-data-async'
    stream:
      variables:
        url: '/process-data-stream'
    immediate:
      variables:
        url: '/process-data-immediate'
    chunks:
      variables:
        url: '/process-data-chunks'
scenarios:
  - name: Data Sync
    flow:
      - parallel:
          - get:
              url: '/ping'
          - get:
              url: '/ping'
          - get:
              url: '/ping'
          - get:
              url: '/ping'
          - get:
              url: '{{ url }}'
          - get:
              url: '/ping'
          - get:
              url: '/ping'
          - get:
              url: '/ping'
          - get:
              url: '/ping'
          - get:
              url: '/ping'